[bits 16]

global start
start:
    cli                 ; отключаем прерывания
    xor bx, bx          ; зануляем bx, обнуляем для записи в ss, и одновременно для команды int 0x13 выставляем смещение адреса записи
    mov ss, bx          ; устанавливаем базу стека на 0
    mov sp, 0x7c00      ; устанавливаем верхнюю границу стека на ячейку в которую выгружается загрузчик

    mov cx, 1           ; устанавливаем в байты номера цилиндра 0, а в сектора 1, чтоб потом он инкрементировался сразу до 2
    mov si, 0x7c0       ; заполняем регистр si, из смещение базы сегмента 0x7c00 << 4, также после добавлении 0x20 сразу установим базу адреса записи на 0x7e00;
    mov ds, si          ; устанавливаем cегмент данных на 0x7c00

driver_read:
        xor dh, dh      ; зануляем указатель на головку, нижнюю часть регистра не зануляем, в нём лежит установленный bios номер диска
    .loop:
        add si, 0x20    ; смещаем адрес записи на 512 байт
        inc cl          ; инкрементируем номера сектора
        cmp cl, 19      ; проверка заходим ли за максимальное количество секторов на дискете т.е за 18
        jnz .post       ; если всё ок, то сразу переходим к чтению
        mov cl, 1       ; сбрасываем в самое начало номер читаемого сектора
        add ch, dh      ; прибавляем к номеру цилиндра номер головки, это корректно ведь если головка равна нулю, то номер цилиндра не меняется, если равна 1 то инкрементировать и нужно
        xor dh, cl      ; dh меняется на противоположный
    .post:
        mov es, si      ; сдвигаем адрес записи
        mov di, 4       ; устанавливаем количество попыток чтения с диска
    .return:
        mov ax, 0x0201  ; задаём в ah - номер команды чтения с диска, al - количество читаемых секторов
        int 0x13        ; производим чтение
        jc .error       ; в случае неудачи прыгаем в обработчик ошибки
        cmp si, 0x7fe0  ; смотрим сколько уже выгруженно (0x8fe00 - 0x7e00 = 480кб)
        jnz .loop       ; переходим в начало цикла если не превысили 480 кб
        jmp protected_mode_enable ; после удачного завершения копирования прыгаем
    .error:
        inc di          ; инкрементируем количество попыток
        jnz .return     ; в случае если к диску уже было совершено 4 неудачных обращения, то просто переходим в пустой цикл, иначе осуществляем ещё одну попытку чтения с диска
    .empty_while:
        jmp .empty_while; пустой цикл

protected_mode_enable:
    cld                 ; Отчищаем Direction Flag, для строковых операций
    mov ds, bx          ; Устанавливаем ds = 0, так как из-за скрипта линковки у переменной gdt_descriptor будет уже правильный физический адрес от нуля
    lgdt [gdt_descriptor]; Загружает адрес таблицы дескрипторов в скрытый регистр
    mov eax, cr0        ; Загрузим в регистр внутренний регистр, чтоб сохранить не интересующие нас флаги
    or al, 1            ; Устанавливаем флаг 32 битного режим
    mov cr0, eax        ; Записываем обновлённое значение в регистр
    jmp code_seg:protected_mode_tramplin ; Совершаем длинный прыжок в 32 битное пространство

[bits 32]
protected_mode_tramplin:
    mov bx, data_seg    ; Записываем уже не базу сегмента, а его смещение в таблице
    mov ds, bx          ; Устанавливаем ds
    mov ss, bx          ; Устанавливаем ss
    mov es, bx          ; Устанавливаем es
    mov fs, bx          ; Устанавливаем fs
    mov gs, bx          ; Устанавливаем gs
[extern kernel_entry]
    jmp kernel_entry    ; Прыгаем в код на Си

;Структура segment descriptor
;63      56 55 54 53 52     48 47   45 44   40                16          0
; |_______|__|__|__|__|______|__|____|__|____|__________________|__________|
;     │    │  │  │  │    │    │    │   │  │           │               └ Размер сегмента - 1 (0 - 15 биты)
;     │    │  │  │  │    │    │    │   │  │           └ База сегмента (0 - 23 биты)
;     │    │  │  │  │    │    │    │   │  └ Accessed flag, 40 бит (1 - если CPU записывал, что-то в этот сегмент)
;     │    │  │  │  │    │    │    │   │    Write enable / Read enable flag, 41 бит
;     │    │  │  │  │    │    │    │   │        (если сегмент кода, то 1 - разрешено и чтение и исполнение, 0 - только исполнение)
;     │    │  │  │  │    │    │    │   │        (если сегмент данных, то 1 - разрешено и чтение и запись, 0 - только чтение)
;     │    │  │  │  │    │    │    │   │    Conforming / Expand-down flag  42 бит
;     │    │  │  │  │    │    │    │   │        (если сегмент кода, то 1 - код может вызываться из кода с меньшим уровнем привилегий, 0 - только с тем же и выше)
;     │    │  │  │  │    │    │    │   │        (если сегмент данных, то выставляем 0)
;     │    │  │  │  │    │    │    │   │    Executable flag, 43 бит (1 - сегмент кода, 0 - сегмент данных)
;     │    │  │  │  │    │    │    │   └ Descriptor type flag (1 - обычный сегмент кода или данных, 0 - пока не нужно)
;     │    │  │  │  │    │    │    └ Descriptor privilege level (Определяет кольцо безопасности с 0 по 3)
;     │    │  │  │  │    │    └ Segment-present flag (Означает выгружена ли реально страница по указанным адресам в память)
;     │    │  │  │  │    └ Размер сегмента - 1. При включенном Granularity flag измеряется в страницах по 4 кб, при отключенном флаге в байтах (16 - 19 биты)
;     │    │  │  │  └ Свободный бит, который допустимо использовать операционной системой в своих нуждах
;     │    │  │  └ Long mode flag (Не используется всегда сброшен на 0)
;     │    │  └ Какая-то ересь с 16 битным режимом (всегда выставляем 1)
;     │    └ Granularity flag (1 - включены страницы по 4 кб, 0 - размер измеряется в байтах
;     └ База сегмента (24 - 31 биты)
gdt_start:
; пустой segment descriptor
    dq 0x0
gdt_code:
; segment descriptor для кода
    dw 0xffff
    dw 0x0000
    db 0x00
    db 0b10011010 ;0x9a
    db 0b11001111 ;0xcf
    db 0x00
gdt_data:
; segment descriptor для данных и стека
    dw 0xffff
    dw 0x0000
    db 0x00
    db 0b10010010 ;0x92
    db 0b11001111 ;0xcf
    db 0x00
gdt_end:


;Структура segment descriptor
;47      32                0
;|________|________________|
;    │             └ Физический адрес начала таблицы дескрипторов
;    └ Размер таблицы дескрипторов - 1
gdt_descriptor:
    dw gdt_end - gdt_start - 1 ;вычисляем размер самого descriptor table
    dd gdt_start

code_seg equ gdt_code - gdt_start
data_seg equ gdt_data - gdt_start

times 510-($-$$) db 0
dw 0xaa55

