[BITS 16]

start:
	cli                 ; Отключаем прерывания
	xor bx, bx          ; Зануляем bx, обнуляем для записи в ss, и одновременно для команды int 0x13 выставляем смещение адреса записи
	mov ss, bx          ; Устанавливаем базу стека на 0
	mov sp, 0x7C00      ; Устанавливаем верхнюю границу стека на ячейку в которую выгружается загрузчик

    mov cx, 1           ; Устанавливаем в байты номера цилиндра 0, а в сектора 1, чтоб потом он инкрементировался сразу до 2
	mov si, 0x7C0       ; Заполняем регистр si, из смещение базы сегмента 0x7C00 << 4, также после добавлении 0x20 сразу установим базу адреса записи на 0x7E00;
	mov ds, si          ; Устанавливаем cегмент данных на 0x7C00

driver_read:
        xor dh, dh      ; Зануляем указатель на головку, нижнюю часть регистра не зануляем, в нём лежит установленный bios номер диска
.loop:
        add si, 0x20    ; Смещаем адрес записи на 512 байт
        inc cl          ; Инкрементируем номера сектора
        cmp cl, 19      ; Проверка заходим ли за максимальное количество секторов на дискете т.е за 18
        jnz .post       ; Если всё ОК, то сразу переходим к чтению
        mov cl, 1       ; Сбрасываем в самое начало номер читаемого сектора
        add ch, dh      ; Прибавляем к номеру цилиндра номер головки, это корректно ведь если головка равна нулю, то номер цилиндра не меняется, если равна 1 то инкрементировать и нужно
        xor dh, cl      ; dh меняется на противоположный
.post:
        mov es, si      ; Сдвигаем адрес записи
.return:
        mov ax, 0x0201  ; Задаём в ah - номер команды чтения с диска, al - количество читаемых секторов
        int 0x13        ; Производим чтение
        jc .end
        cmp si, 0x7FE0  ; Смотрим сколько уже выгруженно (0x8FE00 - 0x7E00 = 480кб)
        jnz .loop       ; Переходим в начало цикла если не превысили 480 кб
.end:
        jmp .end        ; Бесконечный цикл

times 510-($-$$) db 0
dw 0xAA55

